#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tnorlund/gh-actions-demo/runs/run-6T8j6mWhib2bgXGa

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
module.node_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2]
aws_s3_bucket.root: Refreshing state... [id=tylernorlund.com]
aws_cloudfront_distribution.root_distribution: Refreshing state... [id=E1MU4ROA4B79G1]
aws_route53_record.root: Refreshing state... [id=Z020475816IVSC15OQALQ__A]
aws_s3_bucket.www: Refreshing state... [id=www.tylernorlund.com]
aws_route53_zone.zone: Refreshing state... [id=Z020475816IVSC15OQALQ]
aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:681647709217:certificate/ef911372-6a77-4f3d-a9a5-c3d93fe0d33e]
aws_cloudfront_distribution.www_distribution: Refreshing state... [id=E115HUYCZL4AC6]
aws_route53_record.www: Refreshing state... [id=Z020475816IVSC15OQALQ_www.tylernorlund.com_A]
module.analytics.aws_iam_role.kinesis_role: Refreshing state... [id=kinesis_role]
module.python_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_python:2]
module.analytics.aws_iam_role.kinesis: Refreshing state... [id=kinesis_process_role]
module.analytics.aws_cloudwatch_log_group.stream: Refreshing state... [id=/aws/lambda/tylernorlund_blog_analytics]
module.analytics.aws_iam_role.s3: Refreshing state... [id=s3_process_role]
module.analytics.aws_cloudwatch_log_group.processor: Refreshing state... [id=/aws/lambda/firehose-lambda-processor]
module.analytics.aws_dynamodb_table.table: Refreshing state... [id=Blog]
module.analytics.aws_s3_bucket.bucket: Refreshing state... [id=tylernorlund-blog-analytics]
module.analytics.aws_iam_role.lambda_role: Refreshing state... [id=iam_dynamo_stream]
module.analytics.aws_lambda_function.kinesis_processor: Refreshing state... [id=firehose-lambda-processor]
module.analytics.aws_lambda_function.s3: Refreshing state... [id=s3-lambda-processor]
module.analytics.aws_lambda_function.dynamo_db_stream: Refreshing state... [id=dynamodb-lambda-stream]
module.analytics.aws_iam_role_policy.lambda_processor: Refreshing state... [id=kinesis_process_role:terraform-20210227221547702300000002]
module.analytics.aws_iam_role_policy.lambda_policy: Refreshing state... [id=iam_dynamo_stream:terraform-20210227221547709100000003]
module.analytics.aws_iam_role_policy.s3: Refreshing state... [id=s3_process_role:terraform-20210227221547698900000001]
module.analytics.aws_lambda_event_source_mapping.dynamo_mapping: Refreshing state... [id=3fad250d-87fb-4015-abe3-e986710e023a]
module.analytics.aws_kinesis_firehose_delivery_stream.extended_s3_stream: Refreshing state... [id=arn:aws:firehose:us-east-1:681647709217:deliverystream/tylernorlund_blog_analytics]
module.analytics.aws_lambda_permission.s3: Refreshing state... [id=terraform-20210227223821541800000001]
module.analytics.aws_iam_role_policy.kinesis_stream: Refreshing state... [id=kinesis_role:terraform-20210227223821542400000002]
module.analytics.aws_s3_bucket_notification.bucket_terraform_notification: Refreshing state... [id=tylernorlund-blog-analytics]
module.analytics.aws_lambda_permission.blog: Refreshing state... [id=terraform-20210227223900816600000004]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.certificate will be destroyed
  - resource "aws_acm_certificate" "certificate" {
      - arn                       = "arn:aws:acm:us-east-1:681647709217:certificate/ef911372-6a77-4f3d-a9a5-c3d93fe0d33e" -> null
      - domain_name               = "*.tylernorlund.com" -> null
      - domain_validation_options = [] -> null
      - id                        = "arn:aws:acm:us-east-1:681647709217:certificate/ef911372-6a77-4f3d-a9a5-c3d93fe0d33e" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "tylernorlund.com",
        ] -> null
      - tags                      = {} -> null
      - validation_emails         = [
          - "owner-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "hostmaster@tylernorlund.com",
          - "postmaster@tylernorlund.com",
          - "admin-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "admin@tylernorlund.com",
          - "webmaster@tylernorlund.com",
          - "tech-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "administrator@tylernorlund.com",
          - "owner-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "hostmaster@tylernorlund.com",
          - "postmaster@tylernorlund.com",
          - "admin-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "admin@tylernorlund.com",
          - "webmaster@tylernorlund.com",
          - "tech-2203337@tylernorlund.com.whoisprivacyservice.org",
          - "administrator@tylernorlund.com",
        ] -> null
      - validation_method         = "EMAIL" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_cloudfront_distribution.root_distribution will be destroyed
  - resource "aws_cloudfront_distribution" "root_distribution" {
      - aliases                        = [
          - "tylernorlund.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::681647709217:distribution/E1MU4ROA4B79G1" -> null
      - caller_reference               = "terraform-20210228072033595000000002" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d26mxa9gloauhk.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E19YNG7890DUCR" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E1MU4ROA4B79G1" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2021-02-28 07:20:33.757 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = true -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "tylernorlund.com" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - domain_name = "tylernorlund.com.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id   = "tylernorlund.com" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:681647709217:certificate/ef911372-6a77-4f3d-a9a5-c3d93fe0d33e" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_cloudfront_distribution.www_distribution will be destroyed
  - resource "aws_cloudfront_distribution" "www_distribution" {
      - aliases                        = [
          - "www.tylernorlund.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::681647709217:distribution/E115HUYCZL4AC6" -> null
      - caller_reference               = "terraform-20210228044204258000000002" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d1s86ev0xjiuxc.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "EB8YNIH03ZZPE" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E115HUYCZL4AC6" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2021-02-28 17:12:06.184 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = true -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "www.tylernorlund.com" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - domain_name = "www.tylernorlund.com.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id   = "www.tylernorlund.com" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:681647709217:certificate/ef911372-6a77-4f3d-a9a5-c3d93fe0d33e" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_route53_record.root will be destroyed
  - resource "aws_route53_record" "root" {
      - fqdn    = "tylernorlund.com" -> null
      - id      = "Z020475816IVSC15OQALQ__A" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z020475816IVSC15OQALQ" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d26mxa9gloauhk.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_record.www will be destroyed
  - resource "aws_route53_record" "www" {
      - fqdn    = "www.tylernorlund.com" -> null
      - id      = "Z020475816IVSC15OQALQ_www.tylernorlund.com_A" -> null
      - name    = "www.tylernorlund.com" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z020475816IVSC15OQALQ" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d1s86ev0xjiuxc.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_zone.zone will be destroyed
  - resource "aws_route53_zone" "zone" {
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z020475816IVSC15OQALQ" -> null
      - name          = "tylernorlund.com" -> null
      - name_servers  = [
          - "ns-1405.awsdns-47.org",
          - "ns-1906.awsdns-46.co.uk",
          - "ns-383.awsdns-47.com",
          - "ns-671.awsdns-19.net",
        ] -> null
      - tags          = {} -> null
      - zone_id       = "Z020475816IVSC15OQALQ" -> null
    }

  # aws_s3_bucket.root will be destroyed
  - resource "aws_s3_bucket" "root" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::tylernorlund.com" -> null
      - bucket                      = "tylernorlund.com" -> null
      - bucket_domain_name          = "tylernorlund.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "tylernorlund.com.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "tylernorlund.com" -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::tylernorlund.com/*"
                      - Sid       = "AddPerm"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "tylernorlund.com.s3-website-us-east-1.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - redirect_all_requests_to = "https://www.tylernorlund.com" -> null
        }
    }

  # aws_s3_bucket.www will be destroyed
  - resource "aws_s3_bucket" "www" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::www.tylernorlund.com" -> null
      - bucket                      = "www.tylernorlund.com" -> null
      - bucket_domain_name          = "www.tylernorlund.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "www.tylernorlund.com.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "www.tylernorlund.com" -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::www.tylernorlund.com/*"
                      - Sid       = "AddPerm"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "www.tylernorlund.com.s3-website-us-east-1.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "404.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.identity.data.aws_iam_policy_document.auth_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "auth_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "execute-api:InvalidateCache",
              + "execute-api:Invoke",
              + "execute-api:ManageConnections",
              + "firehose:ListDeliveryStreams",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:firehose:us-east-1:681647709217:deliverystream/tylernorlund_blog_analytics",
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "authCommitId"
        }
    }

  # module.identity.data.aws_iam_policy_document.post_confirmation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "post_confirmation"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:AdminAddUserToGroup",
              + "cognito-idp:CreateGroup",
              + "cognito-idp:GetGroup",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:681647709217:table/Blog",
              + "arn:aws:logs:*",
              + (known after apply),
            ]
          + sid       = "codecommitid"
        }
    }

  # module.identity.data.aws_iam_policy_document.unauth_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "unauth_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "execute-api:InvalidateCache",
              + "execute-api:Invoke",
              + "execute-api:ManageConnections",
              + "firehose:ListDeliveryStreams",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:firehose:us-east-1:681647709217:deliverystream/tylernorlund_blog_analytics",
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "unauthCommitId"
        }
    }

  # module.identity.data.aws_iam_policy_document.user_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "user_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "execute-api:InvalidateCache",
              + "execute-api:Invoke",
              + "execute-api:ManageConnections",
              + "firehose:ListDeliveryStreams",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:firehose:us-east-1:681647709217:deliverystream/tylernorlund_blog_analytics",
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "authCommitId"
        }
    }

  # module.identity.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "blog_api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.identity.aws_cognito_identity_pool.main will be created
  + resource "aws_cognito_identity_pool" "main" {
      + allow_unauthenticated_identities = true
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "blog_identity_pool_prod"

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = true
        }
    }

  # module.identity.aws_cognito_identity_pool_roles_attachment.main will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "main" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)
    }

  # module.identity.aws_cognito_user_group.Admin will be created
  + resource "aws_cognito_user_group" "Admin" {
      + description  = "Administrators that can modify the backend"
      + id           = (known after apply)
      + name         = "Admin"
      + precedence   = 1
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.identity.aws_cognito_user_group.User will be created
  + resource "aws_cognito_user_group" "User" {
      + description  = "Users that have signed up and verified their emails"
      + id           = (known after apply)
      + name         = "User"
      + precedence   = 2
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.identity.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "blog_user_pool_prod"
      + sms_verification_message   = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + email_configuration {
          + email_sending_account  = "DEVELOPER"
          + reply_to_email_address = "no-reply@tylernorlund.com"
          + source_arn             = (known after apply)
        }

      + lambda_config {
          + custom_message    = (known after apply)
          + post_confirmation = (known after apply)
        }

      + password_policy {
          + minimum_length    = 8
          + require_lowercase = true
          + require_numbers   = true
          + require_symbols   = true
          + require_uppercase = true
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = true
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "name"
          + required            = true
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.identity.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + client_secret                 = (sensitive value)
      + explicit_auth_flows           = [
          + "ADMIN_NO_SRP_AUTH",
        ]
      + generate_secret               = false
      + id                            = (known after apply)
      + name                          = "client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
    }

  # module.identity.aws_iam_role.auth will be created
  + resource "aws_iam_role" "auth" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.identity.aws_iam_role.custom_message will be created
  + resource "aws_iam_role" "custom_message" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "custommessage"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.identity.aws_iam_role.post_confirmation will be created
  + resource "aws_iam_role" "post_confirmation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "post_confirmation_prod"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.identity.aws_iam_role.unauth will be created
  + resource "aws_iam_role" "unauth" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "unauth_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.identity.aws_iam_role.user will be created
  + resource "aws_iam_role" "user" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "user_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.identity.aws_iam_role_policy.auth will be created
  + resource "aws_iam_role_policy" "auth" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.identity.aws_iam_role_policy.custom_message will be created
  + resource "aws_iam_role_policy" "custom_message" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*",
                          + "arn:aws:dynamodb:us-east-1:681647709217:table/Blog",
                        ]
                      + Sid      = "authCommitId"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.identity.aws_iam_role_policy.post_confirmation will be created
  + resource "aws_iam_role_policy" "post_confirmation" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.identity.aws_iam_role_policy.unauth will be created
  + resource "aws_iam_role_policy" "unauth" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.identity.aws_iam_role_policy.user will be created
  + resource "aws_iam_role_policy" "user" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.identity.aws_lambda_function.custom_message will be created
  + resource "aws_lambda_function" "custom_message" {
      + arn                            = (known after apply)
      + description                    = "An Amazon Cognito Pool trigger that composes a unique message after a user signs up"
      + function_name                  = "custom_message"
      + handler                        = "custom_message.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "tf-cloud"
      + s3_key                         = "custom_message.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "Tyler Norlund"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "Blog"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.identity.aws_lambda_function.post_confirmation will be created
  + resource "aws_lambda_function" "post_confirmation" {
      + arn                            = (known after apply)
      + description                    = "An Amazon Cognito Pool trigger that adds a user to a User Pool and DynamoDB"
      + function_name                  = "post_confirmation"
      + handler                        = "post_confirmation.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "tf-cloud"
      + s3_key                         = "post_confirmation.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "Tyler Norlund"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GROUP"      = "User"
              + "TABLE_NAME" = "Blog"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.identity.aws_lambda_permission.custom_message will be created
  + resource "aws_lambda_permission" "custom_message" {
      + action        = "lambda:InvokeFunction"
      + function_name = "custom_message"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCognito"
    }

  # module.identity.aws_lambda_permission.post_confirmation will be created
  + resource "aws_lambda_permission" "post_confirmation" {
      + action        = "lambda:InvokeFunction"
      + function_name = "post_confirmation"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCognito"
    }

  # module.identity.aws_ses_email_identity.identity will be created
  + resource "aws_ses_email_identity" "identity" {
      + arn   = (known after apply)
      + email = "no-reply@tylernorlund.com"
      + id    = (known after apply)
    }

Plan: 22 to add, 0 to change, 8 to destroy.
```
</details>
*Pusher: @tnorlund, Action: `pull_request`*